#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Deprecated attribute

  on modules/ServicePrincipal/output.tf line 23, in output "service_principal_application_id":
  23:   value       = azuread_service_principal.main.application_id

The attribute "application_id" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mazurerm_resource_group.demo_rg: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo-rg][0m
[0m[1mazurerm_resource_group.aks_demo_rg: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/aks-demo-rg][0m
[0m[1mmodule.ServicePrincipal.data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.ServicePrincipal.data.azuread_client_config.current: Read complete after 0s [id=433c9b93-54ed-4d8f-bada-40aa45f229c1-53d0d4e2-e6ab-4bbc-9f90-a009ee0955b2-ddb37022-1c9c-475b-8365-ac91cb0c7475][0m
[0m[1mazurerm_container_registry.acr: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo-rg/providers/Microsoft.ContainerRegistry/registries/devacrdev0101984][0m
[0m[1mmodule.ServicePrincipal.azuread_application.main: Refreshing state... [id=/applications/10a758ad-c8eb-43eb-a63d-9748dc09a975][0m
[0m[1mmodule.ServicePrincipal.azuread_service_principal.main: Refreshing state... [id=ddb37022-1c9c-475b-8365-ac91cb0c7475][0m
[0m[1mmodule.ServicePrincipal.azuread_service_principal_password.main: Refreshing state... [id=ddb37022-1c9c-475b-8365-ac91cb0c7475/password/44737089-9c97-4425-b89a-cfed0c3e472f][0m
[0m[1mmodule.keyvault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.aks.data.azurerm_kubernetes_service_versions.current: Reading...[0m[0m
[0m[1mazurerm_role_assignment.rolespn: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/providers/Microsoft.Authorization/roleAssignments/ba7502bd-319b-11ae-5406-8e48b61a00d2][0m
[0m[1mmodule.keyvault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01M2QwZDRlMi1lNmFiLTRiYmMtOWY5MC1hMDA5ZWUwOTU1YjI7b2JqZWN0SWQ9ZGRiMzcwMjItMWM5Yy00NzViLTgzNjUtYWM5MWNiMGM3NDc1O3N1YnNjcmlwdGlvbklkPTI0NTE0MGNmLWVlZWEtNGRlZi05ZTdmLWY0MmU5ZDBlNzAxYTt0ZW5hbnRJZD00MzNjOWI5My01NGVkLTRkOGYtYmFkYS00MGFhNDVmMjI5YzE=][0m
[0m[1mmodule.keyvault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo-rg/providers/Microsoft.KeyVault/vaults/new-dev-kv-0101984][0m
[0m[1mmodule.aks.data.azurerm_kubernetes_service_versions.current: Read complete after 1s [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/providers/Microsoft.ContainerService/locations/westeurope][0m
[0m[1mazurerm_key_vault_secret.example: Refreshing state... [id=https://new-dev-kv-0101984.vault.azure.net/secrets/ddb37022-1c9c-475b-8365-ac91cb0c7475/8a2cba31e4c148ab8d34f181f76f97e0][0m
[0m[1mazurerm_role_assignment.key_vault_admin: Refreshing state... [id=/subscriptions/245140cf-eeea-4def-9e7f-f42e9d0e701a/resourceGroups/demo-rg/providers/Microsoft.KeyVault/vaults/new-dev-kv-0101984/providers/Microsoft.Authorization/roleAssignments/9f5024be-8590-e412-d93c-43609fa826dd][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.aks.azurerm_kubernetes_cluster.aks-cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "aks-cluster" {
      [32m+[0m[0m api_server_authorized_ip_ranges     = (known after apply)
      [32m+[0m[0m current_kubernetes_version          = (known after apply)
      [32m+[0m[0m dns_prefix                          = "aks-demo-rg-cluster"
      [32m+[0m[0m fqdn                                = (known after apply)
      [32m+[0m[0m http_application_routing_zone_name  = (known after apply)
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m image_cleaner_enabled               = false
      [32m+[0m[0m image_cleaner_interval_hours        = 48
      [32m+[0m[0m kube_admin_config                   = (sensitive value)
      [32m+[0m[0m kube_admin_config_raw               = (sensitive value)
      [32m+[0m[0m kube_config                         = (sensitive value)
      [32m+[0m[0m kube_config_raw                     = (sensitive value)
      [32m+[0m[0m kubernetes_version                  = "1.29.4"
      [32m+[0m[0m location                            = "westeurope"
      [32m+[0m[0m name                                = "demo-aks-cluster"
      [32m+[0m[0m node_resource_group                 = "aks-demo-rg-nrg"
      [32m+[0m[0m node_resource_group_id              = (known after apply)
      [32m+[0m[0m oidc_issuer_url                     = (known after apply)
      [32m+[0m[0m portal_fqdn                         = (known after apply)
      [32m+[0m[0m private_cluster_enabled             = false
      [32m+[0m[0m private_cluster_public_fqdn_enabled = false
      [32m+[0m[0m private_dns_zone_id                 = (known after apply)
      [32m+[0m[0m private_fqdn                        = (known after apply)
      [32m+[0m[0m public_network_access_enabled       = true
      [32m+[0m[0m resource_group_name                 = "aks-demo-rg"
      [32m+[0m[0m role_based_access_control_enabled   = true
      [32m+[0m[0m run_command_enabled                 = true
      [32m+[0m[0m sku_tier                            = "Free"
      [32m+[0m[0m support_plan                        = "KubernetesOfficial"
      [32m+[0m[0m workload_identity_enabled           = false

      [32m+[0m[0m default_node_pool {
          [32m+[0m[0m enable_auto_scaling  = true
          [32m+[0m[0m kubelet_disk_type    = (known after apply)
          [32m+[0m[0m max_count            = 3
          [32m+[0m[0m max_pods             = (known after apply)
          [32m+[0m[0m min_count            = 1
          [32m+[0m[0m name                 = "defaultpool"
          [32m+[0m[0m node_count           = (known after apply)
          [32m+[0m[0m node_labels          = {
              [32m+[0m[0m "environment"   = "prod"
              [32m+[0m[0m "nodepool-type" = "system"
              [32m+[0m[0m "nodepoolos"    = "linux"
            }
          [32m+[0m[0m orchestrator_version = (known after apply)
          [32m+[0m[0m os_disk_size_gb      = 30
          [32m+[0m[0m os_disk_type         = "Managed"
          [32m+[0m[0m os_sku               = (known after apply)
          [32m+[0m[0m scale_down_mode      = "Delete"
          [32m+[0m[0m tags                 = {
              [32m+[0m[0m "environment"   = "prod"
              [32m+[0m[0m "nodepool-type" = "system"
              [32m+[0m[0m "nodepoolos"    = "linux"
            }
          [32m+[0m[0m type                 = "VirtualMachineScaleSets"
          [32m+[0m[0m ultra_ssd_enabled    = false
          [32m+[0m[0m vm_size              = "Standard_DS2_v2"
          [32m+[0m[0m workload_runtime     = (known after apply)
          [32m+[0m[0m zones                = [
              [32m+[0m[0m "2",
            ]
        }

      [32m+[0m[0m network_profile {
          [32m+[0m[0m dns_service_ip          = (known after apply)
          [32m+[0m[0m docker_bridge_cidr      = (known after apply)
          [32m+[0m[0m ip_versions             = (known after apply)
          [32m+[0m[0m load_balancer_sku       = "standard"
          [32m+[0m[0m network_mode            = (known after apply)
          [32m+[0m[0m network_plugin          = "azure"
          [32m+[0m[0m network_policy          = (known after apply)
          [32m+[0m[0m outbound_ip_address_ids = (known after apply)
          [32m+[0m[0m outbound_ip_prefix_ids  = (known after apply)
          [32m+[0m[0m outbound_type           = "loadBalancer"
          [32m+[0m[0m pod_cidr                = (known after apply)
          [32m+[0m[0m pod_cidrs               = (known after apply)
          [32m+[0m[0m service_cidr            = (known after apply)
          [32m+[0m[0m service_cidrs           = (known after apply)
        }

      [32m+[0m[0m service_principal {
          [32m+[0m[0m client_id     = "53d0d4e2-e6ab-4bbc-9f90-a009ee0955b2"
          [32m+[0m[0m client_secret = (sensitive value)
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "backendsa" but a value
[33m│[0m [0mwas found in file "environments/dev/terraform.tfvars". If you meant to use
[33m│[0m [0mthis value, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "backendcontainer" but a
[33m│[0m [0mvalue was found in file "environments/dev/terraform.tfvars". If you meant
[33m│[0m [0mto use this value, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mDeprecated attribute[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on modules/ServicePrincipal/output.tf line 23, in output "service_principal_application_id":
[33m│[0m [0m  23:   value       = azuread_service_principal.main[4m.application_id[0m[0m
[33m│[0m [0m
[33m│[0m [0mThe attribute "application_id" is deprecated. Refer to the provider
[33m│[0m [0mdocumentation for details.
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @mr-goce, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*